Revit 2027 API
RebarFreeFormAccessor.GetUpdatingSharedParameters Method
 Get the shared parameters listed as dependencies in the calculation of the rebar curves
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetUpdatingSharedParameters()
Public Function GetUpdatingSharedParameters As IList(Of ElementId)
public:
IList<ElementId^>^ GetUpdatingSharedParameters()
member GetUpdatingSharedParameters : unit -> IList<ElementId>
Return Value
IList<ElementId>
 Returns the elementIds of the shared parameters
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace